---
kind: property
id: P:Autodesk.Revit.DB.DisciplineTypeId.Structural
source: html/836b805e-ba8e-65bc-ef34-fad5303a1cce.htm
---
# Autodesk.Revit.DB.DisciplineTypeId.Structural Property

Structural.

## Syntax (C#)
```csharp
public static ForgeTypeId Structural { get; }
```